HancyWang/EMD_TEST_BENCH/EMD_TEST_BENCH/STM32F10x_StdPeriph_Lib_V3.5.0/Project/STM32F10x_StdPeriph_Template/MDK-ARM/STM32F103RCT6/Module/protocol_module.h
/**
********************************************************************************
* 版權：
* 模块名称：protocol.h
* 模块功能：跟上位機進行通信
* 创建日期：
* 创 建 者：
* 声    明：
********************************************************************************
**/
#ifndef __PROTOCOL_H_
#define __PROTOCOL_H_
/***********************************
* 头文件
***********************************/
#include "stm32f10x.h"

/**********************************
*宏定义
***********************************/
#define SEND_DATA_BUF_LENGTH        300  // 波特率 115200
#define CMD_BUFFER_LENGTH         300  //宏定义命令数据包的长度

#define		PACK_HEAD_BYTE				 0xFF //头文件标志
#define   MODULE_CMD_TYPE					0

//模块命令识别号
#define SEND_VOILD_EXP_FLAG_ID     0x01  //有效呼吸次
#define SEND_EXP_TRAIN_DATA_ID     0x02  //存储数据
#define SEND_EXP_TRAIN_DATA_CHECK_SUM_ID     0x03  //存储数据校验和
#define SEND_BAT_PER_ID     0x04  //电池电量

//主机命令识别号
#define GET_EXP_TRAIN_DATA_ID     0x01  //有效呼吸次
//#define GET_BAT_PER_ID     				0x02  //电池电量
//#define PWM_VALUE_SET_ID   				0x03  //设置PWM参数
#define COMM_PARAMETER_ID					0x04  //上位机下发的公共信息
#define GET_FLASH_DATA_1_ID				0x05  //上位机下发的获得flash中参数
#define GET_FLASH_DATA_2_ID				0x06  //上位机下发的获得flash中参数
#define IS_RCV_PARA_FINISHED			0x07  //上位机下发的询问数据是否接收完成
#define SEND_PARA_RCV_RESULT			0x08  //下位机发送接收参数的处理结果
#define SEND_FLASH_DATA_1_ID      0x09  //由于原始数据太长(434Bytes),分成两帧发
#define SEND_FLASH_DATA_2_ID      0x0A  
#define MODE1_PWM1_ID							0x11  //上位机下发的MODE1-PWM1
#define MODE1_PWM2_ID							0x12  //上位机下发的MODE1-PWM1
#define MODE1_PWM3_ID							0x13  //上位机下发的MODE1-PWM1
#define MODE2_PWM1_ID							0x21  //上位机下发的MODE1-PWM1
#define MODE2_PWM2_ID							0x22  //上位机下发的MODE1-PWM1
#define MODE2_PWM3_ID							0x23  //上位机下发的MODE1-PWM1
#define MODE3_PWM1_ID							0x31  //上位机下发的MODE1-PWM1
#define MODE3_PWM2_ID							0x32  //上位机下发的MODE1-PWM1
#define MODE3_PWM3_ID							0x33  //上位机下发的MODE1-PWM1

#define CAL_SENSOR_MMGH_1         0x50  //上位机下发的mmgh的值1
#define CAL_SENSOR_MMGH_2         0x51	//上位机下发的mmgh的值2
#define CAL_SENSOR_MMGH_3         0x52	//上位机下发的mmgh的值3
#define CAL_SENSOR_SEND_TO_PC     0x60  //下位机回传值给上位机


//上位机发送时间，同步RTC
#define RTC_SYN_CMD								0x65  //上位机发送同步命令,并且携带同步数据
#define RTC_SYN_FINISHED					0x66	//下位机发送同步完成

//上位机发送获取rtc信息
#define GET_RTC_RECORD_NUMBERS		0x68  //上位机发送获取rtc数据记录条数
#define SENT_RTC_BYTES						0x69	//下位机发送给上位机总字节数
#define GET_RTC_INFO							0x70  //上位机发送获取下位机的rtc信息命令
#define SEND_RTC_INFO							0x71	//下位机发送rtc信息给上位机
#define GET_SW_VERSION						0x72	//获取软件版本
#define SEND_SW_VERSION						0x73	//发送软件版本

#define GET_PRESSURE_ZERO_POINT		0x74  //上位机发送获取压力sensor的截距
#define SEND_PRESSURE_ZERO_POINT	0x75	//下位机发送截距

//定义上位机写入flash的起始地址
#define FLASH_PAGE_SIZE      			((uint16_t)0x400)  //flash一页的大小为1K
#define FLASH_START_ADDR   				((uint32_t)0x08000000) //flash开始地址
#define FLASH_END_ADDR						((uint32_t)0x08004000) //flash结束地址
#define FLASH_WRITE_START_ADDR		((uint32_t)0x08000000+1024*30) //开始写入的开始地址
#define FLASH_WRITE_END_ADDR      ((uint32_t)0x08004000)  //flash写入的结束地址

//记录开关机时间
#define FLASH_RECORD_PAGE_FROM_TO			((uint32_t)0x08000000+1024*34)   //34K开始记录从那一页到那一页
#define FLASH_RECORD_DATETIME_START	   ((uint32_t)0x08000000+1024*36)
#define FLASH_RECORD_DATETIME_UPLIMIT	((uint32_t)0x08000000+1024*128)  //128K属于上限值，不允许记录了
#define FLASH_PAGE_STEP								1024*2  												//步长为2K，因为070CB的1个page就是2K

#define FLASH_PRESSURE_RATE_ADDR  ((uint32_t)0x08000000+1024*26) //开始写入的开始地址

void FlashRead(uint32_t addr, uint32_t *p_data, uint16_t len);
uint32_t FlashReadWord(uint32_t addr);
//uint32_t FlashReadByte(char* addr);
uint8_t FlashReadByte(uint32_t addr);
//uint16_t FlashWrite(uint32_t addr, uint32_t *p_data, uint16_t len);
uint16_t FlashWrite(uint32_t addr, uint8_t *p_data, uint16_t len);
uint8_t GetModeSelected(void);
void Init_RecordPage(void);
/***********************************
* 变量類型聲明
***********************************/


typedef enum
{
	CODE_SYSTEM_POWER_ON												=	0x11,
	CODE_ONE_CYCLE_FINISHED											=	0x12,
	CODE_MANUAL_POWER_OFF												=	0x13,
//	CODE_NO_TRIGGER_IN_60S_BEFORE_TREAT_START		=	0x14,
	CODE_NO_POWER															=	0x15,
	CODE_OVER_PRESSURE													=	0x16,
	CODE_SYSTEM_BEEN_TRIGGERED									=	0x17,
//	CODE_SELFTEST_FAIL					=	0x18,
	CODE_NO_TRIGGER_IN_60S											= 0x19,
	CODE_PC_SYN_RTC															= 0x20,
	CODE_SWITCH_2_MODE1         								= 0x21,
	CODE_SWITCH_2_MODE2         								= 0x22,
	CODE_SWITCH_2_MODE3         								= 0x23,
	CODE_CURRENT_MODE_IS_1											= 0x24,
	CODE_CURRENT_MODE_IS_2											= 0x25,
	CODE_CURRENT_MODE_IS_3											= 0x26
}SYSTEM_CODE;
/***********************************
* 函数
***********************************/
void protocol_module_process(uint8_t* pdata);

void protocol_module_send_exp_flag(uint8_t flag);
void protocol_module_send_train_data_one_page(uint8_t* buf, uint8_t len);
void protocol_module_send_train_data_check_sum(uint32_t check_sum);
void protocol_module_send_bat_per(uint8_t bat_per);
void get_comm_para_to_buf(uint8_t* pdata);
void get_parameter_to_buf_by_frameId(uint8_t* pdata,char frameId);
void send_prameter_fram1_to_PC(void);
void send_prameter_fram2_to_PC(void);
void record_dateTime(SYSTEM_CODE code);

void send_get_sw_version(void);
void SendQuery1ForParameters(void);
void SendQuery2ForParameters(void);
void send_get_pressure_zero_point(void);
#endif
